In [11]:
import numpy as np
import pandas as pd

shift + tab - podpowiada argumenty metody lub construktora

In [ ]:
# NOTE:
# axis=0 - indicate rows,
# axis=1 - indicate columns

Data in Pandas are kept in NumPy arrays.
Each column in pd.DataFrame is a separate NumPy array

### Series

In [12]:
a = [10, 20, 30, 40, 50]

In [13]:
s1 = pd.Series(a)

In [14]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

### DataFrames

In [15]:
np.random.seed(100)

In [16]:
df = pd.DataFrame(np.random.randn(5,3), columns=['A', 'B' ,'C'])

In [17]:
df

          A         B         C
0 -1.749765  0.342680  1.153036
1 -0.252436  0.981321  0.514219
2  0.221180 -1.070043 -0.189496
3  0.255001 -0.458027  0.435163
4 -0.583595  0.816847  0.672721

In [18]:
df['A']

0   -1.749765
1   -0.252436
2    0.221180
3    0.255001
4   -0.583595
Name: A, dtype: float64

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
type(df['A'])

pandas.core.series.Series

In [21]:
df[['A', 'B']]

          A         B
0 -1.749765  0.342680
1 -0.252436  0.981321
2  0.221180 -1.070043
3  0.255001 -0.458027
4 -0.583595  0.816847

In [22]:
df1 = df.drop('B', axis = 1)

In [23]:
df1

          A         C
0 -1.749765  1.153036
1 -0.252436  0.514219
2  0.221180 -0.189496
3  0.255001  0.435163
4 -0.583595  0.672721

In [24]:
df

          A         B         C
0 -1.749765  0.342680  1.153036
1 -0.252436  0.981321  0.514219
2  0.221180 -1.070043 -0.189496
3  0.255001 -0.458027  0.435163
4 -0.583595  0.816847  0.672721

In [25]:
df.drop('B', axis = 1, inplace=True)

In [26]:
df

          A         C
0 -1.749765  1.153036
1 -0.252436  0.514219
2  0.221180 -0.189496
3  0.255001  0.435163
4 -0.583595  0.672721

In [27]:
df.drop(4)

          A         C
0 -1.749765  1.153036
1 -0.252436  0.514219
2  0.221180 -0.189496
3  0.255001  0.435163

In [28]:
df.shape

(5, 2)

In [33]:
df.loc[2] # returns row with index value 2 as pd.Series

A    0.221180
C   -0.189496
Name: 2, dtype: float64

In [34]:
df.iloc[2] # return row for index

A    0.221180
C   -0.189496
Name: 2, dtype: float64

In [35]:
df.loc[0, 'A']

-1.7497654730546974

In [36]:
df.loc[[0, 1], 'A']

0   -1.749765
1   -0.252436
Name: A, dtype: float64

In [37]:
df = pd.DataFrame(np.random.randn(5,3), columns=['A', 'B' ,'C'])

In [38]:
df

          A         B         C
0 -0.104411 -0.531280  1.029733
1 -0.438136 -1.118318  1.618982
2  1.541605 -0.251879 -0.842436
3  0.184519  0.937082  0.731000
4  1.361556 -0.326238  0.055676

In [39]:
df_bool = df > 0

In [40]:
df_bool

       A      B      C
0  False  False   True
1  False  False   True
2   True  False  False
3   True   True   True
4   True  False   True

In [41]:
df[df_bool]

          A         B         C
0       NaN       NaN  1.029733
1       NaN       NaN  1.618982
2  1.541605       NaN       NaN
3  0.184519  0.937082  0.731000
4  1.361556       NaN  0.055676

In [44]:
df[df['C'] > 0] # value in column C must be > 0 otherwise drop the row

          A         B         C
0 -0.104411 -0.531280  1.029733
1 -0.438136 -1.118318  1.618982
3  0.184519  0.937082  0.731000
4  1.361556 -0.326238  0.055676

In [45]:
df[df['C'] > 0]['A']

0   -0.104411
1   -0.438136
3    0.184519
4    1.361556
Name: A, dtype: float64

In [49]:
df[(df['A']>1) | (df['C']>1)] # OR = | AND = &

          A         B         C
0 -0.104411 -0.531280  1.029733
1 -0.438136 -1.118318  1.618982
2  1.541605 -0.251879 -0.842436
4  1.361556 -0.326238  0.055676

In [50]:
df.reset_index() # previous index will be now a new column and the new one will be numerical starting from 0

   index         A         B         C
0      0 -0.104411 -0.531280  1.029733
1      1 -0.438136 -1.118318  1.618982
2      2  1.541605 -0.251879 -0.842436
3      3  0.184519  0.937082  0.731000
4      4  1.361556 -0.326238  0.055676

In [51]:
codes = "X1 X2 M T S".split()

In [52]:
df['CODES'] = codes

In [53]:
df

          A         B         C CODES
0 -0.104411 -0.531280  1.029733    X1
1 -0.438136 -1.118318  1.618982    X2
2  1.541605 -0.251879 -0.842436     M
3  0.184519  0.937082  0.731000     T
4  1.361556 -0.326238  0.055676     S

#### Index hierarchy

In [57]:
outside_idx = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside_idx = [1, 2, 3, 1, 2, 3]

idx_pairs = list(zip(outside_idx, inside_idx))

In [58]:
idx_pairs

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [56]:
zip(outside_idx, inside_idx)

In [60]:
idx_hierarchy = pd.MultiIndex.from_tuples(idx_pairs)

In [61]:
idx_hierarchy

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [62]:
df2 = pd.DataFrame( np.random.randn(6,3), idx_hierarchy, columns=['A', 'B' ,'C'])

In [63]:
df2

             A         B         C
G1 1  0.222400 -1.443217 -0.756352
   2  0.816454  0.750445 -0.455947
   3  1.189622 -1.690617 -1.356399
G2 1 -1.232435 -0.544439 -0.668172
   2  0.007315 -0.612939  1.299748
   3 -1.733096 -0.983310  0.357508

In [65]:
df2.loc['G1']

          A         B         C
1  0.222400 -1.443217 -0.756352
2  0.816454  0.750445 -0.455947
3  1.189622 -1.690617 -1.356399

In [69]:
df2.loc['G1'].loc[[1,2],['B','C']]

          B         C
1 -1.443217 -0.756352
2  0.750445 -0.455947

In [70]:
df2.index.names

FrozenList([None, None])

In [72]:
df2.index.names = ['GROUP','NUM']

In [73]:
df2

                  A         B         C
GROUP NUM
G1    1    0.222400 -1.443217 -0.756352
      2    0.816454  0.750445 -0.455947
      3    1.189622 -1.690617 -1.356399
G2    1   -1.232435 -0.544439 -0.668172
      2    0.007315 -0.612939  1.299748
      3   -1.733096 -0.983310  0.357508

#### Cross Section

In [74]:
df2.xs(1, level = "NUM")

              A         B         C
GROUP
G1     0.222400 -1.443217 -0.756352
G2    -1.232435 -0.544439 -0.668172

#### Missing Values

In [78]:
data = {'A': [1, 2 ,3], 'B': [10, np.nan, 30], 'C': [np.nan, np.nan, 100]}

In [79]:
df3 = pd.DataFrame(data)

In [80]:
df3

   A     B      C
0  1  10.0    NaN
1  2   NaN    NaN
2  3  30.0  100.0

In [82]:
df3.dropna()

   A     B      C
2  3  30.0  100.0

In [83]:
df3.dropna(axis = 1)

   A
0  1
1  2
2  3

In [85]:
df3.dropna(axis = 0, thresh = 2)

   A     B      C
0  1  10.0    NaN
2  3  30.0  100.0

In [86]:
df3.fillna(value=0)

   A     B      C
0  1  10.0    0.0
1  2   0.0    0.0
2  3  30.0  100.0

In [87]:
df3.fillna('FILL-VALUE')

   A           B           C
0  1        10.0  FILL-VALUE
1  2  FILL-VALUE  FILL-VALUE
2  3        30.0       100.0

In [91]:
df3['B'].fillna(df3['B'].mean())

0    10.0
1    20.0
2    30.0
Name: B, dtype: float64

-0.2581267240827818

#### Group By

In [92]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [93]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [94]:
df4 = pd.DataFrame(data)

In [95]:
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [96]:
df4.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [97]:
df4.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [98]:
df4.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [99]:
df4.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [100]:
df4.describe().transpose()

       count   mean         std    min    25%    50%     75%    max
Sales    6.0  229.5  100.899455  120.0  143.0  221.5  315.75  350.0

#### Merging, Joining & Concatinating

In [101]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [102]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

In [103]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [104]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [105]:
pd.concat([df1, df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [106]:
pd.concat([df1, df2], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [108]:
d1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']})

In [109]:
d2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']})

In [110]:
d1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [111]:
d2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [112]:
pd.merge(d1, d2, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [113]:
d1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']}, index=['K0', 'K1', 'K2'])

In [115]:
d2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'], 'D': ['D0', 'D2', 'D3']}, index=['K0', 'K2', 'K3'])

In [116]:
d1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [117]:
d2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [118]:
d1.join(d2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [119]:
d2.join(d1)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [120]:
d1.join(d2, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

#### Operations

In [121]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [122]:
df = pd.DataFrame(data)

In [123]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [124]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [125]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [128]:
df['Sales'].apply(lambda x: x * 2 + 100)

0    500
1    340
2    780
3    348
4    586
5    800
Name: Sales, dtype: int64

In [131]:
sorted_df = df.sort_values('Company')

In [132]:
sorted_df

  Company   Person  Sales
4      FB     Carl    243
5      FB    Sarah    350
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124

In [133]:
sorted_df.reset_index()

   index Company   Person  Sales
0      4      FB     Carl    243
1      5      FB    Sarah    350
2      0    GOOG      Sam    200
3      1    GOOG  Charlie    120
4      2    MSFT      Amy    340
5      3    MSFT  Vanessa    124

In [134]:
pwd

'/home/wojtek/Workspace/data-science-bootcamp'

In [135]:
ls

first-notebook.ipynb  numpy-training.ipynb

In [136]:
who

a	 codes	 d1	 d2	 data	 df	 df1	 df2	 df3
df4	 df_bool	 idx_hierarchy	 idx_pairs	 index_hierarchy	 inside_idx	 np	 outside_idx	 pd
s1	 sorted_df